In [114]:
import pandas as pd

In [115]:
url='http://bit.ly/drinksbycountry'

In [116]:
drinks=pd.read_csv(url)

In [117]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [118]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [119]:
drinks.beer_servings.astype(float).head()

0      0.0
1     89.0
2     25.0
3    245.0
4    217.0
Name: beer_servings, dtype: float64

In [120]:
drinks.columns=drinks.columns.str.replace('_','-',)

In [121]:
drinks.columns

Index(['country', 'beer-servings', 'spirit-servings', 'wine-servings',
       'total-litres-of-pure-alcohol', 'continent'],
      dtype='object')

In [122]:
drinks.columns=drinks.columns.str.lower()

In [123]:
drinks['country']=drinks.country.str.lower()

In [124]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,afghanistan,0,0,0,0.0,Asia
1,albania,89,132,54,4.9,Europe
2,algeria,25,0,14,0.7,Africa
3,andorra,245,138,312,12.4,Europe
4,angola,217,57,45,5.9,Africa

In [125]:
drinks['+sign']='+'

In [156]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,+ afghanistan,0,0,0,0.0,Asia
1,+ albania,89,132,54,4.9,Europe
2,+ algeria,25,0,14,0.7,Africa
3,+ andorra,245,138,312,12.4,Europe
4,+ angola,217,57,45,5.9,Africa

In [136]:
drinks['country']=(drinks['+sign'] + ' '+ drinks['country'])

In [150]:
drinks.shape

(193, 7)

In [157]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,+ afghanistan,0,0,0,0.0,Asia
1,+ albania,89,132,54,4.9,Europe
2,+ algeria,25,0,14,0.7,Africa
3,+ andorra,245,138,312,12.4,Europe
4,+ angola,217,57,45,5.9,Africa

In [161]:
drinks['country']=drinks.country.str.replace('+','')

In [175]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,afghanistan,0,0,0,0.0,Asia
1,albania,89,132,54,4.9,Europe
2,algeria,25,0,14,0.7,Africa
3,andorra,245,138,312,12.4,Europe
4,angola,217,57,45,5.9,Africa

In [178]:
drinks['country']=drinks.country.str.upper()

In [180]:
drinks.head()

,country,beer-servings,spirit-servings,wine-servings,total-litres-of-pure-alcohol,continent
0,AFGHANISTAN,0,0,0,0.0,Asia
1,ALBANIA,89,132,54,4.9,Europe
2,ALGERIA,25,0,14,0.7,Africa
3,ANDORRA,245,138,312,12.4,Europe
4,ANGOLA,217,57,45,5.9,Africa